TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
//TeegyBigz and TerrienDJV5
//tamagotchi_V0.0.0 for Hardware V1
//ESP-Wroom-32

//DOIT ESP32 DEVKIT V1
//https://lastminuteengineers.com/esp32-pinout-reference/

//https://circuits4you.com/2018/12/31/esp32-hardware-serial2-example/



//https://github.com/nhatuan84/esp32-sh1106-oled/blob/master/Adafruit_SH1106.cpp

//https://linuxhint.com/remove-arduino-library/#b2

//https://forum.arduino.cc/t/how-to-pass-an-object-or-reference-to-a-function/340185/2

//https://randomnerdtutorials.com/esp32-flash-memory/
//https://forum.arduino.cc/t/solved-getting-array-size/506976

//https://rishabhdevyadav.medium.com/create-your-own-arduino-library-h-and-cpp-files-62ab456453e0

//https://www.tutorialspoint.com/c_standard_library/string_h.htm
//https://www.tutorialspoint.com/cprogramming/c_pointers.htm

//https://linuxhint.com/variable-scope-arduino/

//
//https://randomnerdtutorials.com/installing-the-esp32-board-in-arduino-ide-windows-instructions/
//

/* Making ESP32 have filesystem
   https://github.com/me-no-dev/arduino-esp32fs-plugin/releases/
   https://randomnerdtutorials.com/install-esp32-filesystem-uploader-arduino-ide/
*/


//images
//used for converting images to monochrome BMPs
//https://image.online-convert.com/convert-to-bmp
//https://javl.github.io/image2cpp/


//helpful:
//https://roboticsbackend.com/arduino-object-oriented-programming-oop/
//https://dronebotworkshop.com/shift-registers/
//https://forum.arduino.cc/t/static-array-of-strings/411408/6

//https://github.com/arkhipenko/Dictionary

//https://cplusplus.com/reference/cstdlib/itoa/
//https://www.badprog.com/c-type-what-are-uint8-t-uint16-t-uint32-t-and-uint64-t

//https://docs.arduino.cc/learn/programming/memory-guide

//https://www.tutorialspoint.com/structs-in-arduino-program

//https://randomnerdtutorials.com/esp32-dual-core-arduino-ide/
//https://savjee.be/videos/programming-esp32-with-arduino/using-rtc-memory/


//Check this out?
//https://github.com/olikraus/u8g2

#include "FreeRTOSConfig.h" //https://www.freertos.org/a00106.html
#define INCLUDE_eTaskGetState true

#include "esp_attr.h" //https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-guides/memory-types.html


/*#################################################*/
//Try This!
//#include "painlessMesh.h" //https://randomnerdtutorials.com/esp-mesh-esp32-esp8266-painlessmesh/

/*#################################################*/


//Define Simple Functions
#define ARRAY_LEN(array) ((sizeof(array))/(sizeof(array[0])))



/*
   Dictionary
   https://github.com/arkhipenko/Dictionary
*/

//#define _DICT_CRC_ 16
#define _DICT_CRC_ 32
//#define _DICT_CRC_ 64

#define _DICT_PACK_STRUCTURES
//#define _DICT_COMPRESS_SHOCO
//#define _DICT_COMPRESS_SMAZ
#define _DICT_USE_PSRAM  // for ESP32 only


#ifdef _DICT_USE_PSRAM
#define KEYS  10000
#define TESTS 10000
#else
#define KEYS  2000
#define TESTS 10000
#endif

#define _DICT_KEYLEN 64
#define _DICT_VALLEN 256

//#define _DEBUG_
//#define _TEST_

#include <Dictionary.h>


/*
   Dictionary
*/

//Feature Enables (compiler Addons)
#define FeatureEnable_BT_Serial false
#define FeatureEnable_WiFi_Serial true //Option not implemented (enabled or disabled)
#define FeatureEnable_UART_Serial true //Option not implemented (enabled or disabled)

#define FeatureEnable_SH1106_Display true //Option not Fully implemented (enabled or disabled)
#define FeatureEnable_PiSo_Control true //Option not implemented (enabled or disabled)
#define FeatureEnable_WiFiHTTP_Control true //Option not implemented (enabled or disabled)

#define FeatureEnable_IR_RXTX_Control false



//storageDevice modes
#define STORAGE_SELECT_SD 0
#define STORAGE_SELECT_SPIFFS 1
#define STORAGE_SELECT_SDFAT 2
#define STORAGE_SELECT_FFAT 3

#define STORAGE_INCLUDE_SD false
#define STORAGE_INCLUDE_SPIFFS true
#define STORAGE_INCLUDE_SDFAT false
#define STORAGE_INCLUDE_FFAT false

#define STORAGE_DEVICE_DEFAULT 1







//Library startups
#include "Arduino.h"
#include <string>

#include "FS.h"
#include "SPIFFS.h"
//https://www.tutorialspoint.com/esp32_for_iot/esp32_for_iot_spiffs_storage.htm


//Json Support
//<ArduinoJson.h> By Benoit BLANCHON
#include <ArduinoJson.h> //https://arduinojson.org/




/*
helpful Wifi Stuff Urls
//https://www.mischianti.org/2021/03/06/esp32-practical-power-saving-manage-wifi-and-cpu-1/
//https://randomnerdtutorials.com/esp32-wifimulti/
//https://www.megunolink.com/articles/wireless/talk-esp32-over-wifi/
//https://arduino.stackexchange.com/questions/31256/multiple-client-server-over-wifi
//https://github.com/xreef/SimpleFTPServer
*/

//WiFi Support
#include "WiFi.h"
#include <esp_wifi.h>
#include "WiFiType.h"
#include <WiFiMulti.h>
#include <SimpleFTPServer.h> //FTP


WiFiMulti wifiMulti;
FtpServer ftpSrv; //set #define FTP_DEBUG in ESP8266FtpServer.h to see ftp verbose on serial
const uint32_t connectTimeoutMs = 10000; // WiFi connect timeout per AP. Increase when connecting takes longer.
int wifi_status = WL_IDLE_STATUS;
WiFiServer SerialWiFiserver(23);
WiFiClient SerialWiFiclient; // Initialize the client library





//other Stuff Support

#include "time.h"

#include "driver/adc.h"
#include "driver/dac.h"//https://docs.espressif.com/projects/esp-idf/en/v4.3/esp32s2/api-reference/peripherals/dac.html

#include <Preferences.h> //https://espressif-docs.readthedocs-hosted.com/projects/arduino-esp32/en/latest/api/preferences.html
Preferences preferences;



#include <SPI.h>
#include <Wire.h>



#if (FeatureEnable_SH1106_Display==true)
#include <Adafruit_GFX.h>
#include <Adafruit_SH1106.h>
#include "Taskbar.h"

#include <BetterImageStorageObject.h>//By Terrien


#include "BMIMGmanipulate.h"
BMIMGmanipulate bitmapIMGmanipulate0(false);



//#define _TEST_ADAFRUIT_SH1106
#ifdef _TEST_ADAFRUIT_SH1106
#include "Test_Adafruit_SH1106.h"
#endif

#endif



#if (FeatureEnable_PiSo_Control==true)
//https://docs.arduino.cc/learn/contributions/arduino-creating-library-guide
#include "ButtonPISO.h"

#endif



#if (FeatureEnable_BT_Serial==true)
#include "BluetoothSerial.h"

#if !defined(CONFIG_BT_ENABLED) || !defined(CONFIG_BLUEDROID_ENABLED)
#error("Bluetooth is not enabled! Please run `make menuconfig` to and enable it")
#endif
BluetoothSerial SerialBT;
#endif





#if (FeatureEnable_IR_RXTX_Control==true)
/*
   Specify which protocol(s) should be used for decoding.
   If no protocol is defined, all protocols (except Bang&Olufsen) are active.
   This must be done before the #include <IRremote.hpp>
*/
//#define DECODE_DENON        // Includes Sharp
//#define DECODE_JVC
//#define DECODE_KASEIKYO
#define DECODE_PANASONIC    // alias for DECODE_KASEIKYO
//#define DECODE_LG
//#define DECODE_NEC          // Includes Apple and Onkyo
//#define DECODE_SAMSUNG
//#define DECODE_SONY
//#define DECODE_RC5
//#define DECODE_RC6

