TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
//#define DECODE_BOSEWAVE
//#define DECODE_LEGO_PF
//#define DECODE_MAGIQUEST
//#define DECODE_WHYNTER
//#define DECODE_FAST

//#define DECODE_DISTANCE_WIDTH // Universal decoder for pulse distance width protocols
//#define DECODE_HASH         // special decoder for all protocols

//#define DECODE_BEO          // This protocol must always be enabled manually, i.e. it is NOT enabled if no protocol is defined. It prevents decoding of SONY!

//#define DEBUG               // Activate this for lots of lovely debug output from the decoders.

//#define RAW_BUFFER_LENGTH  180  // Default is 112 if DECODE_MAGIQUEST is enabled, otherwise 100.

/*
   This include defines the actual pin number for pins like IR_RECEIVE_PIN, IR_SEND_PIN for many different boards and architectures
*/
//#include "PinDefinitionsAndMore.h"
#include <IRremote.hpp> // include the library
//https://github.com/Arduino-IRremote/Arduino-IRremote

#if !defined(RAW_BUFFER_LENGTH)
#  if RAMEND <= 0x4FF || RAMSIZE < 0x4FF
#define RAW_BUFFER_LENGTH  120
#  elif RAMEND <= 0xAFF || RAMSIZE < 0xAFF // 0xAFF for LEONARDO
#define RAW_BUFFER_LENGTH  400 // 600 is too much here, because we have additional uint8_t rawCode[RAW_BUFFER_LENGTH];
#  else
#define RAW_BUFFER_LENGTH  750
#  endif
#endif

#define DISABLE_CODE_FOR_RECEIVER // Disables restarting receiver after each send. Saves 450 bytes program memory and 269 bytes RAM if receiving functions are not used.
//#define SEND_PWM_BY_TIMER         // Disable carrier PWM generation in software and use (restricted) hardware PWM.
//#define USE_NO_SEND_PWM           // Use no carrier PWM, just simulate an active low receiver signal. Overrides SEND_PWM_BY_TIMER definition
#endif


/*
  define pin Input Variables
*/

//IR Pins
#define IR_TX_Pin 27 //GPIO 27
#define IR_RX_Pin 39 //GPIO 39
#define IR_SEND_PIN 27



//MIC Pin
#define MIC_Pin 34 //GPIO 34


//Buzzer Boi Pin
#define buzzerPin 25//GPIO 25 //DAC1

//BatterySensePin
#define batteryVoltageDivider 36//GPIO 36 //ADC1_CH0



// Define Connections to 74HC165
// PL pin 1
#define BUTTONPISO_PL 32//GPIO 32 //PISO Load
// Q7 pin 7
#define BUTTONPISO_DataIn 35//GPIO 35 //PISO Data
// CP pin 2
#define BUTTONPISO_Clk 33//GPIO 33 //PISO Clock


//I2C Display
#define OLED_SDA 21 //I2C SDA
#define OLED_SCL 22 //I2C SCL

//UART
//U0UXD is generally used to communicate with the ESP32 for programming and during reset/boot.
#define UART0_TX_Pin 1//Used for Programing Board
#define UART0_RX_Pin 3//Used for Programing Board

//U1UXD is unused and can be used for your projects. Some boards use this port for SPI Flash access though!
#define UART1_TX_Pin 10
#define UART1_RX_Pin 9

//U2UXD is unused and can be used for your projects.
#define UART2_TX_Pin 17
#define UART2_RX_Pin 16

//SPI Bus
#define SPI_MoSi_Pin 23
#define SPI_MiSo_Pin 19
#define SPI_SCK_Pin 18
#define SPI_SS_Pin 5



//Devices Setup
#if (FeatureEnable_PiSo_Control==true)
ButtonPISO buttonpiso1(BUTTONPISO_DataIn, BUTTONPISO_Clk, BUTTONPISO_PL);
#endif


Adafruit_SH1106 display(OLED_SDA, OLED_SCL);


//http://electronics4dogs.blogspot.com/2011/01/arduino-predefined-constants.html
#if defined(ESP32)
//#include <HardwareSerial.h>
//HardwareSerial ExtraSerial0(0);//ESP32Serial0
//HardwareSerial ExtraSerial1(1);//ESP32Serial1
//HardwareSerial ExtraSerial2(2);//ESP32Serial2

#endif





#include "LoRa_E220.h"
#define ENABLE_RSSI true
#define FREQUENCY_915
#define E220_22


//https://github.com/xreef/EByte_LoRa_E220_Series_Library


//LoRa_E220 e220ttl(&ExtraSerial2);  // e22 TX e22 RX
LoRa_E220 e220ttl(&Serial2);  // e22 TX e22 RX

//#include "EByte_LoRa_E220_library.h"



//Devices Setup Complete

/*
  #include <pgmspace.h>
  #define buttonNameBufferSize 16
  const char buttonName_0[] PROGMEM = "UP";
  const char buttonName_1[] PROGMEM = "Start";
  const char buttonName_2[] PROGMEM = "Select";
  const char buttonName_3[] PROGMEM = "A";
  const char buttonName_4[] PROGMEM = "LEFT";
  const char buttonName_5[] PROGMEM = "DOWN";
  const char buttonName_6[] PROGMEM = "RIGHT";
  const char buttonName_7[] PROGMEM = "B";

  // Then set up a table to refer to your strings.
  const char* const button_Names_Byjunction[] PROGMEM = {buttonName_0, buttonName_1, buttonName_2, buttonName_3, buttonName_4, buttonName_5, buttonName_6, buttonName_7};

  char buttonNameBuffer[buttonNameBufferSize];    // make sure this is large enough for the largest string it must hold
  //*/

#define buttonPISOcount 8

//Byjunction
char buttonNameString[buttonPISOcount][7] =
{
  "UP",
  "Start",
  "Select",
  "A",
  "LEFT",
  "DOWN",
  "RIGHT",
  "B"
};

char* returnButtonName(byte buttonID, byte opMode = 1) {
  /* Using the string table in program memory requires the use of special functions to retrieve the data.
       The strcpy_P function copies a string from program space to a string in RAM ("buffer").
       Make sure your receiving string in RAM  is large enough to hold whatever
       you are retrieving from program space. */
  /*
    if (opMode == 0) {
    strcpy_P(buttonNameBuffer, (char*)pgm_read_word(&(button_Names_Byjunction[ buttonID ]))); // Necessary casts and dereferencing, just copy.
    return buttonNameBuffer;
    }
  */
  if (opMode == 1) {
    return buttonNameString[buttonID];
  }
}
unsigned int returnButtonID(char* buttonName) {
  for (unsigned int i = 0; i < ARRAY_LEN(buttonNameString); i++) {
    if (buttonNameString[i] == buttonName) {
      return i;
    }
  }

}



#define maxDebugCommandScan 1024

#define maxDebugCommandLength 256
//https://www.arduino.cc/reference/en/language/variables/utilities/progmem/
#include <pgmspace.h>
const char debugCommand_0[] PROGMEM = "";
const char debugCommand_1[] PROGMEM = "";
const char debugCommand_2[] PROGMEM = "";
const char debugCommand_3[] PROGMEM = "";
const char debugCommand_4[] PROGMEM = "";
const char debugCommand_5[] PROGMEM = "";
const char debugCommand_6[] PROGMEM = "";
const char debugCommand_7[] PROGMEM = "";
const char debugCommand_8[] PROGMEM = "";
const char debugCommand_9[] PROGMEM = "";
const char debugCommand_10[] PROGMEM = "";
const char debugCommand_11[] PROGMEM = "";
const char debugCommand_12[] PROGMEM = "";
const char debugCommand_13[] PROGMEM = "";
const char debugCommand_14[] PROGMEM = "";
const char debugCommand_15[] PROGMEM = "";
const char debugCommand_16[] PROGMEM = "";
const char debugCommand_17[] PROGMEM = "";
const char debugCommand_18[] PROGMEM = "";
const char debugCommand_19[] PROGMEM = "";
const char debugCommand_20[] PROGMEM = "";
const char debugCommand_21[] PROGMEM = "";
const char debugCommand_22[] PROGMEM = "";
const char debugCommand_23[] PROGMEM = "";
const char debugCommand_24[] PROGMEM = "";
const char debugCommand_25[] PROGMEM = "";
const char debugCommand_26[] PROGMEM = "";
const char debugCommand_27[] PROGMEM = "";
const char debugCommand_28[] PROGMEM = "";
const char debugCommand_29[] PROGMEM = "";
const char debugCommand_30[] PROGMEM = "";
const char debugCommand_31[] PROGMEM = "";

// Then set up a table to refer to your strings.
const char* const debugCommand_List[] PROGMEM = {debugCommand_0, debugCommand_1, debugCommand_2, debugCommand_3, debugCommand_4, debugCommand_5, debugCommand_6, debugCommand_7, debugCommand_8, debugCommand_9, debugCommand_10, debugCommand_11, debugCommand_12, debugCommand_13, debugCommand_14, debugCommand_15, debugCommand_16, debugCommand_17, debugCommand_18, debugCommand_19, debugCommand_20, debugCommand_21, debugCommand_22, debugCommand_23, debugCommand_24, debugCommand_25, debugCommand_26, debugCommand_27, debugCommand_28, debugCommand_29, debugCommand_30, debugCommand_31};

char debugCommandBuffer[maxDebugCommandLength];    // make sure this is large enough for the largest string it must hold







