TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
#if (FeatureEnable_SH1106_Display==true)
#if (SH1106_LCDHEIGHT != 64)
#error("Height incorrect, please fix Adafruit_SH1106.h!");
#endif
#endif



//Debug Based
byte showDebugMenu = 0;//0 = no debug menu, 1= first debug menu, etc
bool disableButtonPISO_update = false;

//System Variables
unsigned int currentMenuID = 0;
unsigned int previousMenuID = 0;
unsigned long frameCountVariable;//This variable stores the number of frames that have been displayed since the program started.
static unsigned char* batteryIconBigImage; //batteryBig_bitmapimg.dat
static unsigned int batteryIconBigWidth;
static unsigned int batteryIconBigHeight;
int cursorXPos = 0;
int cursorYPos = 0;
long int frameStartTime;// micros()
long int frameEndTime;// micros()
double system_Frame_FPS;


//selection menu //currentMenuID==1
static int sm_selectedID = 0;
static char smOptionName_List[][32 + 1] = {
  "Main Menu",
  "Selection Menu",
  "LoRa Menu Unfinished",
  "Wifi Menu Unfinished",
  "BT Menu Unfinished",
  "IR Menu Unfinished",
  "Sensor Menu Unfinished",
  "Mic/Biz Menu Unfinished",
  "SPIFFS File System Unfinished",
  "SD File System Menu Unfinished",
  "IP Menu",
  "Composite Video Test",
  "Op12",
  "Op13",
  "Op14",
  "Op15",
  "Op15",
  "Op16",
  "Op17",
  "Op18",
  "Op19",
  "Op20",
  "Op21",
  "Op22",
  "Op23",
  "Op24",
  "Op25",
  "Op26",
  "Op27",
  "Op28",
  "Op29",
  "Op30",
  "Op31",
};


//Wifi Menu //currentMenuID==3
static unsigned long lastScanTimer;


//SPIFFs menu //currentMenuID==8






//character variables
const unsigned int characterPixelWidth = 32;//4 bytes
const unsigned int characterPixelHeight = 56;
const unsigned int characterFrameByteSize = ((characterPixelWidth % 8 + characterPixelWidth) >> 3) * characterPixelHeight;
const unsigned int characterBufferFrameCount = 32;
static unsigned char visableCharacterBuffer[ characterBufferFrameCount ][ characterFrameByteSize ];

//Sprite Storage/Memory (_gMSB)(__GMSB__)
const unsigned int spritePagePixelWidth = 1024;
const unsigned int spritePagePixelHeight = 1024;
const byte spritePagePixelData_Bit_Length = 1;
#define CAL_BUFF_BYTE_SIZE__GMSB__(pixW, pixH, pixDataBitL) ( int(pixW/((8)/pixDataBitL))*pixH )//(PixelWidth, PixelHeight, PixelData_Bit_Length)
unsigned int calculateBufferByteSize_gMSB( unsigned int pixW, unsigned int pixH, byte pixDataBitL ){return ( int(pixW/((8)/pixDataBitL))*pixH );};


static unsigned char global_Master_Sprite_Buffer[ CAL_BUFF_BYTE_SIZE__GMSB__( spritePagePixelWidth, spritePagePixelHeight, spritePagePixelData_Bit_Length ) ];






//battery Variabls
static unsigned int batteryXpos = 99;
static unsigned int batteryYpos = 1;
static volatile bool autoUPdateBatteryVariables = true;//used for Debuging
static volatile byte batteryPercent = 100;//out of 100
static volatile double batteryVoltage = 0;
static volatile bool chargingFlag = false;

//cable Icon Variables
byte cableStatus = 0;

//user Settings
byte taskbarRotation = 1;//1
int frame_location_offset = 16;

//timeSettings
//time(), gmtime(), localtime(), mktime(), gettimeofday()
//https://lastminuteengineers.com/esp32-ntp-server-date-time-tutorial/
const char* ntpServer = "pool.ntp.org";
const long  gmtOffset_sec = (-5)*60*60;
const int   daylightOffset_sec = 3600;
bool timeConfigured = false;


void printLocalTime(Stream &serialport){
  struct tm timeinfo;
  if(!getLocalTime(&timeinfo)){
    serialport.println("Failed to obtain time");
    return;
  }
  serialport.println(&timeinfo, "%A, %B %d %Y %H:%M:%S");
  serialport.print("Day of week: ");
  serialport.println(&timeinfo, "%A");
  serialport.print("Month: ");
  serialport.println(&timeinfo, "%B");
  serialport.print("Day of Month: ");
  serialport.println(&timeinfo, "%d");
  serialport.print("Year: ");
  serialport.println(&timeinfo, "%Y");
  serialport.print("Hour: ");
  serialport.println(&timeinfo, "%H");
  serialport.print("Hour (12 hour format): ");
  serialport.println(&timeinfo, "%I");
  serialport.print("Minute: ");
  serialport.println(&timeinfo, "%M");
  serialport.print("Second: ");
  serialport.println(&timeinfo, "%S");

  serialport.println("Time variables");
  char timeHour[3];
  strftime(timeHour,3, "%H", &timeinfo);
  serialport.println(timeHour);
  char timeWeekDay[10];
  strftime(timeWeekDay,10, "%A", &timeinfo);
  serialport.println(timeWeekDay);
  serialport.println();
}



/*

   Sprites Sheet and Tiles Sheet

*/


static const unsigned char PROGMEM rotateImageTestIcon[] =
{
  B11111111, B11111111, B00000000, B00000000,
  B10000000, B00000001, B00000000, B00000000,
  B10000000, B00000001, B00000000, B00000000,
  B10000000, B00000001, B00000000, B00000000,
  B10000000, B00000001, B00000000, B00000000,
  B10000000, B00000001, B00000000, B00000000,
  B10000000, B00000001, B00000000, B00000000,
  B10000000, B00000001, B00000000, B00000000,
  B10000000, B11111111, B00000000, B00000000,
  B10000000, B10000001, B00000000, B00000000,
  B10000000, B10000001, B00000000, B00000000,
  B10000000, B10000001, B00000000, B00000000,
  B10000000, B10000001, B00000000, B00000000,
  B10000000, B10000001, B00000000, B00000000,
  B10000000, B10000001, B00000000, B00000000,
  B11111111, B11111111, B00000000, B00000000,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B11111111,
  B00000000, B00000000, B00000000, B11111111,
  B00000000, B00000000, B00000000, B11111111,
  B00000000, B00000000, B00000000, B11111111,
  B00000000, B00000000, B00000000, B11111111,
  B00000000, B00000000, B00000000, B11111111,
  B00000000, B00000000, B11111111, B11111111
};

static const unsigned char PROGMEM wifi16x16Icon[] =
{
  B11111111, B11111111,
  B10000000, B00000001,
  B10000000, B00000001,
  B10000000, B00000001,
  B10000000, B00000001,
  B10000000, B00000001,
  B10000000, B00000001,
  B10000000, B00000001,
  B10000000, B00000001,
  B00000000, B00000000,
  B00000000, B00000000,
  B00011111, B11111000,
  B00111000, B00011100,
  B00110011, B11001100,
  B00000111, B11100000,
  B00000111, B11100000,
};

static const unsigned char PROGMEM LoRa16x16Icon[] =
{
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11111111, B11111111,
  B11111111, B11111111,
};

