TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
  }
  Serial.println("Returning True!");
  return true;
}
bool ensureValid_PASSchar(char* inputPASS){
  //Enter a string of at least 8 characters to a maximum of 63 characters. Acceptable characters include upper and lower case alphabetic letters, the numeric digits, and special symbols such as @ and #.
  unsigned int inputPASSLen = strlen(inputPASS);
  if ( ((inputPASSLen>63)or(inputPASSLen<8)) and (inputPASSLen!=0) ){
    Serial.println("Returning False!");
    return false;
  }
  Serial.println("Returning True!");
  return true;
}


bool isCharRange(char inputChar, unsigned int startv, unsigned int endv){
  return (inputChar >= startv and inputChar < endv);
}




/*
//https://playground.arduino.cc/Code/Enum/
enum userType
{
   x,
   y,
   z
};
*/






void saveWiFicredentials(Credentials_WiFi_Struct &wifiCredentials){
  // "/Wifi_Connections.json"
  List_WiFi_Credentials_Struct temp_wifiCredentialList;
  //Load WiFiCredentialsList
  Serial.println(F("Loading WiFi configuration..."));
  loadWiFiCredentialsList("/Wifi_Connections.json", temp_wifiCredentialList, SPIFFS);
  Serial.println(wifiCredentials.ssid);
  Serial.println(wifiCredentials.pass);
  saveWiFiCredentialToWiFiCredentialsList(temp_wifiCredentialList, wifiCredentials);
  saveWiFiCredentialsList("/Wifi_Connections.json", temp_wifiCredentialList, SPIFFS);
}





void OnWiFiEvent(WiFiEvent_t event)
{
  //https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-guides/wifi.html
  switch (event) {
    case SYSTEM_EVENT_STA_CONNECTED:
      showPrePrint(Serial, "(ON_SYSTEM_EVENT)-->");
      Serial.println(F("ESP32 Connected to WiFi Network"));
      showPrePrint(Serial, "(ON_SYSTEM_EVENT)-->");
      Serial.println(F("the ESP32 is connected in station mode to an access point/hotspot (your router)"));
      break;
    case SYSTEM_EVENT_STA_DISCONNECTED:
      showPrePrint(Serial, "(ON_SYSTEM_EVENT)-->");
      Serial.println(F("the ESP32 station disconnected from the access point."));
      break;
    case SYSTEM_EVENT_AP_START:
      showPrePrint(Serial, "(ON_SYSTEM_EVENT)-->");
      Serial.println(F("ESP32 soft AP started"));
      break;
    case SYSTEM_EVENT_AP_STOP:
      showPrePrint(Serial, "(ON_SYSTEM_EVENT)-->");
      Serial.println(F("ESP32 soft AP Stopped."));
      break;
    case SYSTEM_EVENT_AP_STACONNECTED:
      showPrePrint(Serial, "(ON_SYSTEM_EVENT)-->");
      Serial.println(F("Station connected to ESP32 soft AP"));
      break;
    case SYSTEM_EVENT_AP_STADISCONNECTED:
      showPrePrint(Serial, "(ON_SYSTEM_EVENT)-->");
      Serial.println(F("Station disconnected from ESP32 soft AP"));
      break;
    
    default:
      showPrePrint(Serial, "(ON_SYSTEM_EVENT)-->");
      Serial.print("(CatchALL)-->");
      Serial.printf("Got Event: %d\n", event);
      break;
  }
}








void startSoftAP(Stream &serialport){
  //https://randomnerdtutorials.com/esp32-access-point-ap-web-server/
  char ssid[33]     = "ESP32-Access-Point";
  char password[64] = "123456789";
  // Connect to Wi-Fi network with SSID and password
  serialport.print("Setting AP (Access Point)…");
  WiFi.softAPConfig(ip, gateway, subnet);
  // Remove the password parameter, if you want the AP (Access Point) to be open
  (void)WiFi.softAP(ssid, password);
  ;
  IPAddress IP = WiFi.softAPIP();
  serialport.print("AP IP address: ");
  serialport.println(IP);
}


//https://www.mischianti.org/2021/03/06/esp32-practical-power-saving-manage-wifi-and-cpu-1/
void disable_STA_WiFi() {
  WiFi.disconnect(true);  // Disconnect from the network
  disableWiFi_STA_Mode();
}



void enable_STA_WiFi() {
  //Remove This Function if it becomes basically on necessary
  //https://docs.arduino.cc/library-examples/wifi-library/ScanNetworks
  enableWiFi_STA_Mode();
  
  WiFi.disconnect(false);  // Reconnect the network
  
  //WiFi.begin(STA_SSID, STA_PASS);
  //wifi_status = WiFi.begin("TP-Link_0F3D", "Jerkface13597603");//control WiFi connect "TP-Link_0F3D" "Jerkface13597603"
  //wifi_status = WiFi.begin("Hail Hydra", "aarsabteeros@48");//control WiFi connect "Hail Hydra" "aarsabteeros@48"
  //wifi_status = WiFi.begin("Test Network", "12345678");
  
  /*
  int numSsid = WiFi.scanNetworks();
  if (numSsid == -1) {
    Serial.println("Couldn't get a wifi connection");
    return;
  }
  */
  
  
  //
  
  /*
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    Serial.print(".");
  }//*/
  /*
  if (WiFi.waitForConnectResult() != WL_CONNECTED) {
    Serial.printf("WiFi Failed!\n");
    return;
  }
  //*/
  Serial.println("");
  Serial.println("WiFi connected");
  Serial.println("IP address: ");
  Serial.println(WiFi.localIP());
}


//https://techtutorialsx.com/2021/01/04/esp32-soft-ap-and-station-modes/
void disableWiFiSoftAP()
{
  WiFi.softAPdisconnect(false);
  WiFi.enableAP(false);
  disableWiFi_AP_Mode();
}

void enableWiFiSoftAP(char* soft_ap_ssid, char* soft_ap_password)
{
  //https://espressif-docs.readthedocs-hosted.com/projects/arduino-esp32/en/latest/api/wifi.html
  WiFi.softAPdisconnect(true);
  WiFi.enableAP(true);
  enableWiFi_AP_Mode();
  //bool softAP(const char* ssid, const char* passphrase = NULL, int channel = 1, int ssid_hidden = 0, int max_connection = 4, bool ftm_responder = false);
  WiFi.softAP(soft_ap_ssid, soft_ap_password);
}


/*
 * \/ Mode Disable/Enable \/
 */
 void disableWiFi_AP_Mode() {
  if (WiFi.getMode() == WIFI_MODE_AP) {
    WiFi.mode(WIFI_OFF);
  } else if (WiFi.getMode() == WIFI_MODE_APSTA) {
    WiFi.mode(WIFI_STA);
  }
}
void enableWiFi_AP_Mode() {
  if (WiFi.getMode() == WIFI_MODE_NULL) {
    WiFi.mode(WIFI_AP);
  } else if (WiFi.getMode() == WIFI_MODE_APSTA) {
    WiFi.mode(WIFI_AP_STA);
  }
}
void disableWiFi_STA_Mode() {
  if (WiFi.getMode() == WIFI_MODE_STA) {
    WiFi.mode(WIFI_OFF);
  } else if (WiFi.getMode() == WIFI_MODE_APSTA) {
    WiFi.mode(WIFI_AP);
  }
}
void enableWiFi_STA_Mode() {
  if (WiFi.getMode() == WIFI_MODE_NULL) {
    WiFi.mode(WIFI_STA);
  } else if (WiFi.getMode() == WIFI_MODE_AP) {
    WiFi.mode(WIFI_AP_STA);
  }
}
/*
 * /\ Mode Disable/Enable /\
 */


void printAPStationNum(Stream &serialport){
  serialport.printf("Stations connected to soft-AP = %d\n", WiFi.softAPgetStationNum());
}




