TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
    bitmapGIF.frameCount = ((file.read()) << 8) | (file.read());
    bitmapGIF.subframeCompressionFlags = file.read();
    bitmapGIF.cropSFCompression = (bitmapGIF.subframeCompressionFlags & 0b10000000) == 0b10000000;
    bitmapGIF.rotationSFCompression = (bitmapGIF.subframeCompressionFlags & 0b01000000) == 0b01000000;
    bitmapGIF.globalsubimageByteLength = ((file.read()) << 8) | (file.read());
    bitmapGIF.widthGPx = ((file.read()) << 8) | (file.read());
    bitmapGIF.heightGPx = ((file.read()) << 8) | (file.read());

    //allocate
    bitmapGIF.subFramePointers = (GIFframebitmapStruct*)malloc(bitmapGIF.frameCount*32);
    

    gifdataReadIndex = 0;
    imagedataSize = 0;
    for (int frameIndex = 0; frameIndex < bitmapGIF.frameCount; frameIndex++) {
      //subimageByteLength, subimageByteOffset, frameStaydelayms, locxPxOffset, locyPxOffset, widthPx, heightPx, subframeDataRotation
      
      if (bitmapGIF.cropSFCompression | bitmapGIF.rotationSFCompression) {
        bitmapGIF.subFramePointers[ frameIndex ].frameByteLength = ((file.read()) << 8) | (file.read());
        bitmapGIF.subFramePointers[ frameIndex ].widthPx = ((file.read()) << 8) | (file.read());
        bitmapGIF.subFramePointers[ frameIndex ].frameByteLength -= 2;
        bitmapGIF.subFramePointers[ frameIndex ].heightPx = ((file.read()) << 8) | (file.read());
        bitmapGIF.subFramePointers[ frameIndex ].frameByteLength -= 2;
      }
      if (bitmapGIF.cropSFCompression) {
        bitmapGIF.subFramePointers[ frameIndex ].locPxOffset.x = ((file.read()) << 8) | (file.read());
        bitmapGIF.subFramePointers[ frameIndex ].frameByteLength -= 2;
        bitmapGIF.subFramePointers[ frameIndex ].locPxOffset.y = ((file.read()) << 8) | (file.read());
        bitmapGIF.subFramePointers[ frameIndex ].frameByteLength -= 2;
      }
      if (bitmapGIF.rotationSFCompression) {
        bitmapGIF.subFramePointers[ frameIndex ].subframeDataRotation = file.read();
        bitmapGIF.subFramePointers[ frameIndex ].frameByteLength -= 1;
      }
      bitmapGIF.subFramePointers[ frameIndex ].frameStaydelayms = ((file.read()) << 8) | (file.read());
      bitmapGIF.subFramePointers[ frameIndex ].frameDataPool = (unsigned char*)malloc(bitmapGIF.subFramePointers[ frameIndex ].frameByteLength);
      if (bitmapGIF.cropSFCompression | bitmapGIF.rotationSFCompression) {
        bitmapGIF.subFramePointers[ frameIndex ].frameByteLength -= 2;

        gifdataReadIndex += bitmapGIF.subFramePointers[ frameIndex ].frameByteLength;
        imagedataSize += bitmapGIF.subFramePointers[ frameIndex ].frameByteLength;
        file.read( bitmapGIF.subFramePointers[ frameIndex ].frameDataPool, bitmapGIF.subFramePointers[ frameIndex ].frameByteLength );
      } else {
        bitmapGIF.subFramePointers[ frameIndex ].frameByteLength -= 2;
        
        gifdataReadIndex += bitmapGIF.subFramePointers[ frameIndex ].frameByteLength;
        imagedataSize += bitmapGIF.subFramePointers[ frameIndex ].frameByteLength;
        file.read( bitmapGIF.subFramePointers[ frameIndex ].frameDataPool, bitmapGIF.subFramePointers[ frameIndex ].frameByteLength );
      }

    }

    free(dataFileVersionString);
  }
  free(checkHeaderFormat);
  Serial.println("load_struct_bitmapGIF_dat_File: End");
}


void display_struct_bitmapGIF(Adafruit_SH1106 &display, GIFbitmapStruct &bitmapGIF, int frame, int locx, int locy) {
  Serial.println("display_struct_bitmapGIF");
  for (byte index = frame; index <= frame; index++) {
    printFreeHeap(Serial);
    Serial.print("index: "); Serial.println(index);
    //Serial.print("subimageByteOffset: "); Serial.println(bitmapGIF.subimageByteOffset[ index ]);
    Serial.print("frameCount: "); Serial.println(bitmapGIF.frameCount);
    Serial.print("gifByteLength: "); Serial.println(bitmapGIF.gifByteLength);

    if (bitmapGIF.cropSFCompression | bitmapGIF.rotationSFCompression) {
      unsigned char* imageTemp;
      imageTemp = (unsigned char*)malloc(bitmapGIF.subFramePointers[ index ].frameByteLength);
      Serial.print("bitmapGIF.subFramePointers[ index ].frameByteLength: "); Serial.println(bitmapGIF.subFramePointers[ index ].frameByteLength);
      memcpy(imageTemp, bitmapGIF.subFramePointers[ index ].frameDataPool, bitmapGIF.subFramePointers[ index ].frameByteLength);
      if (bitmapGIF.cropSFCompression) {
        display.drawBitmap(locx + bitmapGIF.subFramePointers[ index ].locPxOffset.x, locy + bitmapGIF.subFramePointers[ index ].locPxOffset.y, imageTemp, bitmapGIF.subFramePointers[ index ].widthPx, bitmapGIF.subFramePointers[ index ].heightPx, WHITE);
      } else if (bitmapGIF.rotationSFCompression) {
        //add rotate
        display.drawBitmap(locx, locy, imageTemp, bitmapGIF.subFramePointers[ index ].widthPx, bitmapGIF.subFramePointers[ index ].heightPx, WHITE);
      }
      free(imageTemp);
    } else {
      Serial.println("Old Format");
      //Serial.println(bitmapGIF.globalsubimageByteLength);
      //Serial.println(ESP.getMaxAllocHeap());
      /*
        uint32_t getHeapSize(); //total heap size
        uint32_t getFreeHeap(); //available heap
        uint32_t getMinFreeHeap(); //lowest level of free heap since boot
        uint32_t getMaxAllocHeap(); //largest block of heap that can be allocated at once
      */
      printFreeHeap(Serial);
      display.drawBitmap(bitmapGIF.subFramePointers[ index ].locPxOffset.x, bitmapGIF.subFramePointers[ index ].locPxOffset.y, bitmapGIF.subFramePointers[ index ].frameDataPool, bitmapGIF.subFramePointers[ index ].widthPx, bitmapGIF.subFramePointers[ index ].heightPx, WHITE);
    }
    printFreeHeap(Serial);
  }
  Serial.println("display_struct_bitmapGIF: End");
}



/*
   Struct Images and Animations: End
*/















void load_bitmapdat_File(unsigned char*&, unsigned int&, unsigned int&, unsigned int&, File &);

void load_bitmapdat_File(unsigned char* &imageloadlocation, unsigned int &imageDataLength, unsigned int &widthPointer, unsigned int &heightPointer, File &fileBMP) {
  if (!fileBMP) {
    Serial.println("Failed to open file for reading");
    return;
  }
  Serial.printf("Address stored in widthPointer variable: %x\n", &widthPointer  );
  Serial.printf("Value of widthPointer variable: %d\n", widthPointer );
  Serial.printf("Address stored in heightPointer variable: %x\n", &heightPointer  );
  Serial.printf("Value of heightPointer variable: %d\n", heightPointer );
  unsigned int frameDataSize;
  frameDataSize = ((fileBMP.read()) << 8) | (fileBMP.read());
  unsigned int frameWidthSize;
  frameWidthSize = ((fileBMP.read()) << 8) | (fileBMP.read()); frameWidthSize++;
  frameDataSize -= 2;
  unsigned int frameHeightSize;
  frameHeightSize = ((fileBMP.read()) << 8) | (fileBMP.read()); frameHeightSize++;
  frameDataSize -= 2;
  //unsigned char* fileImageDataBuffer;
  //fileImageDataBuffer = (unsigned char*)malloc(frameDataSize+1);
  imageloadlocation = (unsigned char*)malloc(frameDataSize + 1);
  fileBMP.read(imageloadlocation, frameDataSize);
  widthPointer = frameWidthSize;
  heightPointer = frameHeightSize;
  imageDataLength = frameDataSize;

  //display.drawBitmap(0, 0, fileImageDataBuffer, frameWidthSize, frameHeightSize, WHITE);
}



void readbitmapdatFile(Adafruit_SH1106 &display, File &fileBMP);

