TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
//https://docs.espressif.com/projects/esp-idf/en/v4.3/esp32s2/api-reference/peripherals/index.html
void setup()   {
  Serial.begin(115200);
  Serial.print("setup() running on core "); Serial.println(xPortGetCoreID());
  printFreeHeap(Serial);
  //https://espressif-docs.readthedocs-hosted.com/projects/arduino-esp32/en/latest/api/preferences.html
  //https://randomnerdtutorials.com/esp32-save-data-permanently-preferences/
  Serial.println( preferences.begin("boyKisser", false, "nvs"));
  preferences.end();
  //setup Pins

#if (FeatureEnable_IR_RXTX_Control==true)
  //IR Pins
  //pinMode(IR_TX_Pin, OUTPUT);
  IrSender.begin(IR_TX_Pin, ENABLE_LED_FEEDBACK, USE_DEFAULT_FEEDBACK_LED_PIN); // Specify send pin and enable feedback LED at default feedback LED pin

  //pinMode(IR_RX_Pin, INPUT);
  IrReceiver.begin(IR_RX_Pin, ENABLE_LED_FEEDBACK); // Start the receiver
#endif

  //MIC Pin
  pinMode(MIC_Pin, INPUT);


  //Buzzer Boi Pin
  //https://github.com/pschatzmann/arduino-audio-tools
  pinMode(buzzerPin, OUTPUT);

  //BatterySensePin
  pinMode(batteryVoltageDivider, INPUT);

  // Startup all pins and UART
  e220ttl.begin();//LoRa Usage



  //Enable Devices
  adc_power_on();

  //https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-guides/performance/size.html#idf-py-size
  printFreeHeap(Serial);
#if (FeatureEnable_BT_Serial==true)
  SerialBT.begin("ESP32btSerial"); //Bluetooth device name
  Serial.println("The device started, now you can pair it with bluetooth!");
  printFreeHeap(Serial);
#endif



  if (!SPIFFS.begin(true)) {
    Serial.println("An Error has occurred while mounting SPIFFS");
    return;
  }
  File file;
  file = SPIFFS.open("/test_example.txt");
  if (!file) {
    Serial.println("Failed to open file for reading");
    return;
  }

  Serial.println("File Content:");
  while (file.available()) {
    Serial.write(file.read());
  }
  file.close();

  file = SPIFFS.open("/Wifi_Connections.json");
  if (!file) {
    Serial.println("Failed to open file for reading");
    return;
  }

  Serial.println("File Content:");
  while (file.available()) {
    Serial.write(file.read());
  }
  file.close();


  /*
    Dictionary *buttonNamesDict = new Dictionary();//buttonNamesDict
    buttonNamesDict->insert("0", "key_Up");
    buttonNamesDict->insert("1", "key_Start");
    buttonNamesDict->insert("2", "key_Select");
    buttonNamesDict->insert("3", "key_A");
    buttonNamesDict->insert("4", "key_Left");
    buttonNamesDict->insert("5", "key_Down");
    buttonNamesDict->insert("6", "key_Right");
    buttonNamesDict->insert("7", "key_B");
  */


  // by default, we'll generate the high voltage from the 3.3v line internally! (neat!)
  display.begin(SH1106_SWITCHCAPVCC, 0x3C);  // initialize with the I2C addr 0x3D (for the 128x64)
  // init done

  // Show image buffer on the display hardware.
  // Since the buffer is intialized with an Adafruit splashscreen
  // internally, this will display the splashscreen.
  display.display();
  delay(200);

  // Clear the buffer.
  display.stopscroll();
  display.clearDisplay();  
  
  


  /*
   * Startup Tests Starts
   */
  //Text Image Read
  printFreeHeap(Serial);

  /*
    static unsigned char animationFrameBuffer[1024*16];
    unsigned char* framepointerArray[22];
    File fileBMP;
    fileBMP = SPIFFS.open("/boyKisserFaceGif_bitmapgif.dat");
    //loads file into large buffer then saves pointers and plays frames from pointers
    unsigned char* imageloadlocation;
    unsigned int imageDataLength = 0;
    unsigned int imageWidth = 0;
    unsigned int imageHeight = 0;
    Serial.println("File Content:");
    unsigned int currentFrame = 0;
    unsigned int currentAnimationDataLength = 0;

    while(fileBMP.available()){
    load_bitmapdat_File(imageloadlocation, imageDataLength, imageWidth, imageHeight, fileBMP);
    framepointerArray[currentFrame] = &animationFrameBuffer[ currentAnimationDataLength ];
    memcpy(framepointerArray[currentFrame], imageloadlocation, imageDataLength);
    currentAnimationDataLength += imageDataLength;
    Serial.println(currentFrame);
    currentFrame++;
    }

    fileBMP.close();

    long int t1 = micros();
    for (unsigned int index=0; index < 22; index++){
    display.clearDisplay();
    display.drawBitmap(0, 0, framepointerArray[index], imageWidth, imageHeight, WHITE);
    display.display();
    }
    long int t2 = micros();
    display.clearDisplay();
    display.setCursor(0, 0);
    display.setTextSize(1);
    display.setTextColor(WHITE);
    display.print("Frames: "); display.print( 22 ); display.println();
    display.print("T-Time(ns): "); display.print( t2-t1 ); display.println("");
    display.print("FPS: "); display.print( (double)(22/((double)(t2-t1)/1000000)) ); display.println();
    //Serial.print("Time taken by the task: "); Serial.print(t2-t1); Serial.println(" microseconds(ns)");
    display.display();
    delay(1500);
  */
  printFreeHeap(Serial);
  
  
  test_bitmapgif_dat_FBF();
  
  delay(250);
  test_bitmapgif_dat_GIF();
  
  delay(250);
  
  

  Serial.println("Testing ImageObject!");
  unsigned char imagebuffer[64] = {
    1,1,1,1,0,0,0,1,
    1,1,1,1,0,0,1,0,
    1,1,1,1,0,1,0,0,
    1,1,1,1,1,0,0,0,
    1,1,1,1,1,0,0,0,
    1,1,1,1,0,1,0,0,
    1,1,1,1,0,0,1,0,
    1,1,1,1,0,0,0,1,
  };
  //Test And FineTone Me
  ImageObject boyKisserIMGOBJ(true, false, 8, 8, 1);
  for (int indexY = 0; indexY < 8; indexY++) {
    for (int indexX = 0; indexX < 8; indexX++) {
      uint8_t w = imagebuffer[indexX + indexY*8];
      PixelStruct pixel = boyKisserIMGOBJ.setPixelStructValues(w, w, w);
      boyKisserIMGOBJ.setPixelValue(indexX, indexY, pixel);
    }
  }
  for (int indexY = 0; indexY < boyKisserIMGOBJ.getHeight(); indexY++) {
    for (int indexX = 0; indexX < boyKisserIMGOBJ.getWidth(); indexX++) {
      PixelStruct pixel = boyKisserIMGOBJ.getPixelValue(indexX, indexY);
      Serial.print("{ w=");
      Serial.print(pixel.white);
      Serial.print(", r=");
      Serial.print(pixel.red);
      Serial.print(", g=");
      Serial.print(pixel.green);
      Serial.print(", b=");
      Serial.print(pixel.blue);
      Serial.print(", a=");
      Serial.print(pixel.alpha);
      Serial.print("},");
    }
    Serial.println();
  }
  Serial.println("Testing ImageObject Complete!");
  
  
  printFreeHeap(Serial);
  /*
  {
  File fileBMP;
  fileBMP = SPIFFS.open("/boyKisserFaceGif_bitmapgif.dat");
  readbitmapdatFile(display, fileBMP);
  fileBMP.close();
  }
  delay(250);
  //*/
  
