TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
  /*
  {
  //Neco-Arc_bitmapimg.dat
  File fileBMP;
  fileBMP = SPIFFS.open("/Neco-Arc_bitmapimg.dat");
  readbitmapdatFile(display, fileBMP);
  fileBMP.close();
  }
  delay(250);
  */

  printFreeHeap(Serial);
  bool hexTest = false;//true;
  if (hexTest)
  {
  File fileBMP;
  fileBMP = SPIFFS.open("/boyKisserFaceGif_bitmapgif.hex");
  if (!fileBMP) {
    Serial.println("Failed to open file for reading");
    return;
  }
  Serial.println("File Content:");
  while (fileBMP.available()) {
    char fileDataSizeBuffer[(2) * 2 + 1];
    char fileImageDataBuffer[2048];
    memset(fileDataSizeBuffer, '\0', (2) * 2 + 1);
    memset(fileImageDataBuffer, '\0', 2048);
    fileBMP.readBytes(fileDataSizeBuffer, (2) * 2);
    //Serial.write(fileDataSizeBuffer, strlen(fileDataSizeBuffer));
    //Serial.println();
    uint16_t frameDataSize;
    char *ptr;
    frameDataSize = strtol(fileDataSizeBuffer, &ptr, 16);
    fileBMP.readBytes(fileImageDataBuffer, (frameDataSize) * 2);
    //Serial.write(fileImageDataBuffer, strlen(fileImageDataBuffer));
    //Serial.println();
    char tempCharArray[3]; memset(tempCharArray, '\0', 3);
    strncpy(tempCharArray, &fileImageDataBuffer[(0 * 2) * 2], (2) * 2);
    uint16_t frameWidthSize = strtol(tempCharArray, &ptr, 16) + 1;
    strncpy(tempCharArray, &fileImageDataBuffer[(1 * 2) * 2], (2) * 2);
    uint16_t frameHeightSize = strtol(tempCharArray, &ptr, 16) + 1;
    display.clearDisplay();
    display.drawBitmap(0, 0, convertTextHextoCharArray( &fileImageDataBuffer[(2) * 2 + (2) * 2] ), frameWidthSize, frameHeightSize, WHITE); //Test Image Read
    display.display();
  }
  fileBMP.close();
  }
  delay(250);

  printFreeHeap(Serial);
  
  /*{
  //Neco-Arc_bitmapimg.txt
  File fileBMP;
  fileBMP = SPIFFS.open("/Neco-Arc_bitmapimg.txt");
  if (!fileBMP) {
    Serial.println("Failed to open file for reading");
    return;
  }
  Serial.println("File Content:");
  while (fileBMP.available()) {
    char filereadBuffer[2048];
    char fileImageBuffer[2048];
    memset(filereadBuffer, '\0', 2048);
    memset(fileImageBuffer, '\0', 2048);
    fileBMP.readBytesUntil('\n', filereadBuffer, 2048);
    fileBMP.readBytesUntil('\n', fileImageBuffer, 2048);
    display.clearDisplay();
    display.drawBitmap(0, 0, convertTextHextoCharArray( fileImageBuffer ), 32, 56, WHITE);//Test Image Read
    display.display();
  }
  fileBMP.close();
  }//*/
  //delay(500);

  printFreeHeap(Serial);
  
  bool rotTest = true;//true;
  if (rotTest)
  {
  //"/boyKisserFaceGif_bitmapgif.txt"
  File fileBMP;
  fileBMP = SPIFFS.open("/boyKisserFaceGif_bitmapgif.txt");
  if (!fileBMP) {
    Serial.println("Failed to open file for reading");
    return;
  }
  Serial.println("File Content:");
  while (fileBMP.available()) {
    printFreeHeap(Serial);
    char filereadBuffer[2048];
    char fileImageBuffer[2048];
    memset(filereadBuffer, '\0', 2048);
    memset(fileImageBuffer, '\0', 2048);
    fileBMP.readBytesUntil('\n', filereadBuffer, 2048);
    fileBMP.readBytesUntil('\n', fileImageBuffer, 2048);
    //Serial.write(filereadBuffer, strlen(filereadBuffer));
    //Serial.println();
    //Serial.write(fileImageBuffer, strlen(fileImageBuffer));
    //Serial.println();
    printFreeHeap(Serial);
    display.clearDisplay();
    display.drawBitmap(0, 0, convertTextHextoCharArray( fileImageBuffer ), 85, 64, WHITE);//Test Image Read
    ///*
    printFreeHeap(Serial);
    unsigned char* rotateImageTest;
    rotateImageTest = (unsigned char *) calloc(4 * 32, sizeof(unsigned char *)); //32*32
    bitmapIMGmanipulate0.rotateBitImageClockwise( rotateImageTest, (unsigned char*)rotateImageTestIcon, 32, 32);//rotates 90 deg clockwise //new Px Width and Height will be flipped
    display.drawBitmap(90, 0, rotateImageTest, 32, 32, WHITE);//Test Image Read
    //*/
    display.display();
    Serial.println("Displayed");
    //delay(2000);
    ///*
    printFreeHeap(Serial);
    unsigned char* betterRotateImageTest;
    betterRotateImageTest = (unsigned char *) calloc(16 * 128, sizeof(unsigned char *)); //85*64
    Serial.println("CheckPoint");
    bitmapIMGmanipulate0.rotateBitImageClockwise( betterRotateImageTest, convertTextHextoCharArray( fileImageBuffer ), 85, 64);//rotates 90 deg clockwise //new Px Width and Height will be flipped
    display.clearDisplay();
    display.drawBitmap(0, 0, betterRotateImageTest, 64, 85, WHITE);//Test Image Read
    display.display();
    free(betterRotateImageTest);
    //*/
    //delay(2000);
  }
  fileBMP.close();
  }

  printFreeHeap(Serial);
  /*
   * Startup Tests Ends
   */

  /*
   * Load Sprites Start
   */
  {
  File fileBMP;
  fileBMP = SPIFFS.open("/batteryBig_bitmapimg.dat");
  while (fileBMP.available()) {
    unsigned char* imageloadlocation;
    unsigned int imageDataLength = 0;
    load_bitmapdat_File(imageloadlocation, imageDataLength, batteryIconBigWidth, batteryIconBigHeight, fileBMP);
    batteryIconBigImage = (unsigned char*)malloc(imageDataLength + 1);
    memcpy(&batteryIconBigImage[0], imageloadlocation, imageDataLength);
  }
  fileBMP.close();
  }

  {
  File fileBMP;
  fileBMP = SPIFFS.open("/Neco-Arc_bitmapimg.dat");
  while (fileBMP.available()) {
    unsigned char* imageloadlocation;
    unsigned int imageDataLength = 0;
    unsigned int imageWidth = 0;
    unsigned int imageHeight = 0;
    load_bitmapdat_File(imageloadlocation, imageDataLength, imageWidth, imageHeight, fileBMP);
    //adds to charater Buffer
    memcpy(&visableCharacterBuffer[ 0 ], imageloadlocation, imageDataLength);//4*56
  }
  fileBMP.close();
  }
  
  /*
   * Load Sprites End
   */
  
  
  display.clearDisplay();
#ifdef _TEST_ADAFRUIT_SH1106
  setupTest(disptestBitFramelay);
#endif
  
  // Should load default config if run for the first time
  Serial.println(F("Loading configuration..."));
  loadConfiguration(filename, config);

  // Create configuration file
  Serial.println(F("Saving configuration..."));
  saveConfiguration(filename, config);

  // Dump config file
  Serial.println(F("Print config file..."));
  printFile(filename, SPIFFS);
  
  
  
