TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
  }

  //IR menu //currentMenuID==5
  if (currentMenuID == 5) {
    menu_IR();    
  }



  //SPIFFs menu //currentMenuID==8
  if (currentMenuID == 8) {
    menu_SPIFFS();
  }

  //IP menu //currentMenuID==10
  if (currentMenuID == 10) {
    menu_IP();
  }
  //Composite Video Test //currentMenuID==11
  if (currentMenuID == 11) {
    //Add Me As an Option
    ;
  }
  
  
  {
  if (buttonpiso1.isPressed(2) == true) {//Select
    batteryPercent = 100;
    frame_location_offset --; //frameCountVariable%10;
    if (frame_location_offset < (-0)) {
      frame_location_offset = (-0);
    };
    drawTaskbar(display, frame_location_offset, taskbarRotation);
    display.setCursor(4, 52);
    display.setTextSize(1.5);
    display.setTextColor(WHITE);
    display.println("TaskBarDrawn:");
  } else {
    frame_location_offset ++;
    if (frame_location_offset > (9)) {
      frame_location_offset = (9);
    };
    if (frame_location_offset < (9)) {
      drawTaskbar(display, frame_location_offset, taskbarRotation);
      display.setCursor(4, 52);
      display.setTextSize(1.5);
      display.setTextColor(WHITE);
      display.println("TaskBarDrawn:");
    }
  };
  }
  if (buttonpiso1.isTapped(1) == true) {//start
    if (currentMenuID == 0) {
      previousMenuID = currentMenuID;
      currentMenuID = 1;
    } else if (currentMenuID == 1) {
      previousMenuID = currentMenuID;
      currentMenuID = 0;
    } else {
      previousMenuID = currentMenuID;
      currentMenuID = 1;
    }
  }
  if (!(currentMenuID==0 | currentMenuID==1 | currentMenuID==2)){
    display.setTextSize(1);
    display.setTextColor(WHITE);
    display.print("currentMenuID:"); display.println(currentMenuID);
  }
  
  printScrollText(display, "OwO123456789ABCDEFOwOabcdef", 5, frameCountVariable);
  
  //display.print("CPU Freq: ");display.println(getCpuFrequencyMhz());
  
  //checkPoint
  //ToDo
  //make a file Viewer
  //make Functions for LoRa Data
  //WiFi
  //Buzzer
  //IR
  //Sensors
  //UI
  
  checkAllDebugInputs();
  
  printFreeHeap(Serial);
  printHeapFrag(Serial);
  display.print("FreeHeap:"); display.print(ESP.getFreeHeap()); display.print(" B"); display.println();
  display.print("HeapFrag:"); display.print(getFragmentation()); display.print("%"); display.println();
  display.print("AP IP address: "); display.print( WiFi.softAPIP() ); display.println();
  
  //update some variables

  //Draw Button Press GUI
  if (buttonpiso1.getRAWState()!=0b00000000){
    int bGUI_PosX = 0;
    int bGUI_PosY = 46;
    int bGUI_LenX = 30;
    int bGUI_LenY = 17;
    //Position2D_int_Struct bGUIPoint0 = {bGUI_PosX, bGUI_PosY};
    Position2D_int_Struct bGUIPoint0;
    bGUIPoint0.x = bGUI_PosX;
    bGUIPoint0.y = bGUI_PosY;
    Position2D_int_Struct bGUIPoint1;
    bGUIPoint1.x = bGUI_PosX+8;
    bGUIPoint1.y = bGUI_PosY;
    Position2D_int_Struct bGUIPoint2;
    bGUIPoint2.x = bGUI_PosX+11;
    bGUIPoint2.y = bGUI_PosY+4;
    Position2D_int_Struct bGUIPoint3;
    bGUIPoint3.x = bGUI_PosX;
    bGUIPoint3.y = bGUI_PosY+bGUI_LenY;
    Position2D_int_Struct bGUIPoint4;
    bGUIPoint4.x = bGUI_PosX+bGUI_LenX;
    bGUIPoint4.y = bGUI_PosY+4;
    Position2D_int_Struct bGUIPoint5;
    bGUIPoint5.x = bGUI_PosX+bGUI_LenX;
    bGUIPoint5.y = bGUI_PosY+bGUI_LenY-5;
    Position2D_int_Struct bGUIPoint6;
    bGUIPoint6.x = bGUI_PosX+bGUI_LenX-5;
    bGUIPoint6.y = bGUI_PosY+bGUI_LenY;

    display.fillTriangle(bGUIPoint0.x, bGUIPoint0.y,
                         bGUIPoint1.x, bGUIPoint1.y,
                         bGUIPoint2.x, bGUIPoint2.y, WHITE);
    display.fillTriangle(bGUIPoint0.x, bGUIPoint0.y,
                         bGUIPoint3.x, bGUIPoint3.y,
                         bGUIPoint2.x, bGUIPoint2.y, WHITE);
    display.fillTriangle(bGUIPoint2.x, bGUIPoint2.y,
                         bGUIPoint4.x, bGUIPoint4.y,
                         bGUIPoint5.x, bGUIPoint5.y, WHITE);
    display.fillTriangle(bGUIPoint2.x, bGUIPoint2.y,
                         bGUIPoint6.x, bGUIPoint6.y,
                         bGUIPoint3.x, bGUIPoint3.y, WHITE);
    display.fillTriangle(bGUIPoint2.x, bGUIPoint2.y,
                         bGUIPoint5.x, bGUIPoint5.y,
                         bGUIPoint6.x, bGUIPoint6.y, WHITE);

    display.fillTriangle(bGUIPoint0.x+1, bGUIPoint0.y+1,
                         bGUIPoint1.x-1, bGUIPoint1.y+1,
                         bGUIPoint2.x-1, bGUIPoint2.y+1, BLACK);
    display.fillTriangle(bGUIPoint0.x+1, bGUIPoint0.y+1,
                         bGUIPoint3.x+1, bGUIPoint3.y-1,
                         bGUIPoint2.x-1, bGUIPoint2.y+1, BLACK);
    display.fillTriangle(bGUIPoint2.x-1, bGUIPoint2.y+1,
                         bGUIPoint4.x-1, bGUIPoint4.y+1,
                         bGUIPoint5.x-1, bGUIPoint5.y+0, BLACK);
    display.fillTriangle(bGUIPoint2.x-1, bGUIPoint2.y+1,
                         bGUIPoint6.x+0, bGUIPoint6.y-1,
                         bGUIPoint3.x+1, bGUIPoint3.y-1, BLACK);
    display.fillTriangle(bGUIPoint2.x-1, bGUIPoint2.y+1,
                         bGUIPoint5.x-1, bGUIPoint5.y+0,
                         bGUIPoint6.x+0, bGUIPoint6.y-1, BLACK);
    
    Position2D_int_Struct bGUIInputIconPos;
    bGUIInputIconPos.x = bGUI_PosX+2;
    bGUIInputIconPos.y = bGUI_PosY+2;
    Position2D_int_Struct bGUIInputIconLength;
    bGUIInputIconLength.x = 4;
    bGUIInputIconLength.y = 8;
    
    //if buttonInput Mode is HTTPS
    display.fillRect(bGUIInputIconPos.x, bGUIInputIconPos.y, bGUIInputIconLength.x, bGUIInputIconLength.y, BLACK);
    display.drawBitmap(bGUIInputIconPos.x, bGUIInputIconPos.y, buttonInputIcon4x8[1], bGUIInputIconLength.x, bGUIInputIconLength.y, WHITE);
    
    //if buttonInput Mode is PISO
    display.fillRect(bGUIInputIconPos.x, bGUIInputIconPos.y, bGUIInputIconLength.x, bGUIInputIconLength.y, BLACK);
    display.drawBitmap(bGUIInputIconPos.x, bGUIInputIconPos.y, buttonInputIcon4x8[0], bGUIInputIconLength.x, bGUIInputIconLength.y, WHITE);
    
    
    Position2D_int_Struct bGUIButtonPos;
    bGUIButtonPos.x = bGUI_PosX+2+1;
    bGUIButtonPos.y = bGUI_PosY+8-2;
    
    //Start
    display.fillRect(bGUIButtonPos.x+11+0, bGUIButtonPos.y+0+0, 4, 4, WHITE);
    display.fillRect(bGUIButtonPos.x+11+1, bGUIButtonPos.y+0+1, 2, 2, BLACK);
    //Select
    display.fillRect(bGUIButtonPos.x+16+0, bGUIButtonPos.y+0+0, 4, 4, WHITE);
    display.fillRect(bGUIButtonPos.x+16+1, bGUIButtonPos.y+0+1, 2, 2, BLACK);
    
