TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
    // Is something goes wrong print error
    if (rc.status.code != 1) {
      Serial.println(rc.status.getResponseDescription());
      display.println(rc.status.getResponseDescription());
    } else {
      struct tm timeinfo;
      if(!getLocalTime(&timeinfo)){
        Serial.println("Failed to obtain time");
      }
      Serial.println(&timeinfo, "%A, %B %d %Y %H:%M:%S");
      char timeInfoChar[64+1];
      strftime(timeInfoChar,64+1, "%A, %B %d %Y %H:%M:%S", &timeinfo);
      Serial.println(timeInfoChar);
      timeLog = timeInfoChar;
      messageLog = rc.data;
      // Print the data received
      Serial.println(rc.status.getResponseDescription());
      Serial.println(rc.data);
      Serial.println(rc.data[0], DEC);//IDK
      Serial.println(rc.data[1], DEC);//IDK
      Serial.println(rc.data[2], DEC);//channel
      display.println(rc.status.getResponseDescription());
      display.println(rc.data);
      #ifdef ENABLE_RSSI
      Serial.print("RSSI: "); Serial.println(rc.rssi, DEC);
      display.print("RSSI: "); display.println(rc.rssi, DEC);
      #endif
    }
    {
      // Send message
      //ResponseStatus rs = e220ttl.sendBroadcastFixedMessage(0, 0, 0x17, &messaggione, sizeof(Messaggione));
      ResponseStatus rs = e220ttl.sendBroadcastFixedMessage(0x17, "Message Received!");
      // Check If there is some problem of succesfully send
      Serial.println(rs.getResponseDescription());
    }
    {
      String input = "Oh, i bet you like kissing boys, boykisser!";
      e220ttl.sendMessage(input);
    }
    
  }
  display.println("MessageLog: ");
  display.print(timeLog);
  display.println();
  
  display.print("\"");
  display.print(messageLog);
  display.print("\"");
  display.println();
  display.setCursor(0, 5 * 8);
}

void menu_SPIFFS(){
  display.clearDisplay();
  //https://techtutorialsx.com/2019/02/23/esp32-arduino-list-all-files-in-the-spiffs-file-system/
  display.setCursor(0, 1 * 8);
  display.setTextSize(1);
  display.setTextColor(WHITE);
  display.print("SPIFFs Menu"); display.println();
  unsigned int fileCount = 0;
  int fileSelect = 0;
  unsigned int fileDisplayOffset = 0;
  unsigned int fileDisplayOffsetMax = 7;
  unsigned int currentNameSaveCount = 8;
  unsigned int extendNameSaveCountSize = 4;
  unsigned int maxFileNameLength = 32;
  char *savedFileNames;
  char *savedFileNamesExtendBuffer;
  savedFileNames = (char *)malloc( currentNameSaveCount * maxFileNameLength );
  memset(savedFileNames, '\0', currentNameSaveCount * maxFileNameLength);
  Serial.println("CheckPoint-00");
  File root = SPIFFS.open("/");
  printDirectory(root, 0);
  Serial.println("CheckPoint-01");
  free(savedFileNames);
}

void printDirectory(File dir, int numTabs) {
  while (true) {
    File entry =  dir.openNextFile();
    if (! entry) {
      // no more files
      break;
    }
    for (uint8_t i = 0; i < numTabs; i++) {
      Serial.print('\t');
    }
    Serial.print(entry.name());
    if (entry.isDirectory()) {
      Serial.println("/");
      printDirectory(entry, numTabs + 1);
    } else {
      // files have sizes, directories do not
      Serial.print("\t\t");
      Serial.print(entry.size(), DEC);
      Serial.print("\t --> ");
      Serial.print(numTabs);
      Serial.println();
    }
    entry.close();
  }
}


void menu_WIFI(){
  display.clearDisplay();
  //https://randomnerdtutorials.com/esp32-useful-wi-fi-functions-arduino/
  //https://arduino-esp8266.readthedocs.io/en/latest/esp8266wifi/soft-access-point-class.html
  display.setCursor(0, 1 * 8);
  display.setTextSize(1);
  display.setTextColor(WHITE);
  display.print("WiFi Menu"); display.println();
  if (buttonpiso1.isTapped(3) == true) {//A
    if (WiFi.getMode() == WIFI_MODE_NULL) {
      enable_STA_WiFi();
    } else {
      disable_STA_WiFi();
    }
  }
  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("WiFi connected");
    Serial.println("IP address: ");
    Serial.println(WiFi.localIP());
  }
  if (WiFi.status() != WL_CONNECTED) {
    if (WiFi.getMode() != WIFI_MODE_NULL) {
      int n;
      int showOnScreenConnection = 7;
      if ((millis() - lastScanTimer) > 60000) {
        n = WiFi.scanNetworks();
        lastScanTimer = millis();
      }
      display.print("Connections: "); display.println(n);
      for (int index = 0; index < n; index++) {
        display.print(WiFi.SSID(index)); display.print(" RRSI: "); display.println(WiFi.RSSI(index));
      }
    }
  }
  
  Serial.print("WiFi.getMode():"); Serial.print(WiFi.getMode()); Serial.print(", ");
  if (WiFi.getMode() == WIFI_MODE_NULL) {
    Serial.println("WiFi.getMode() == WIFI_MODE_NULL");
  };
  if (WiFi.getMode() == WIFI_MODE_STA) {
    Serial.println("WiFi.getMode() == WIFI_MODE_STA");
  };
  if (WiFi.getMode() == WIFI_MODE_AP) {
    Serial.println("WiFi.getMode() == WIFI_MODE_AP");
  };
  if (WiFi.getMode() == WIFI_MODE_APSTA) {
    Serial.println("WiFi.getMode() == WIFI_MODE_APSTA");
  };
  if (WiFi.getMode() == WIFI_MODE_MAX) {
    Serial.println("WiFi.getMode() == WIFI_MODE_MAX");
  };
  
  if (WiFi.getMode() == WIFI_MODE_NULL) {
    display.println("WiFi.getMode() == WIFI_MODE_NULL");
  };
  if (WiFi.getMode() == WIFI_MODE_STA) {
    display.println("WiFi.getMode() == WIFI_MODE_STA");
  };
  if (WiFi.getMode() == WIFI_MODE_AP) {
    display.println("WiFi.getMode() == WIFI_MODE_AP");
  };
  if (WiFi.getMode() == WIFI_MODE_APSTA) {
    display.println("WiFi.getMode() == WIFI_MODE_APSTA");
  };
  if (WiFi.getMode() == WIFI_MODE_MAX) {
    display.println("WiFi.getMode() == WIFI_MODE_MAX");
  };
}

void menu_IR(){
  display.clearDisplay();
  display.setCursor(0, 0);
  display.setTextSize(1);
  display.setTextColor(WHITE);
  display.print("IR Menu"); display.println();
  display.print("Functionality Not yet added!"); display.println();
}

void menu_IP(){
  display.clearDisplay();
  display.setCursor(0, 0);
  display.setTextSize(1);
  display.setTextColor(WHITE);
  display.print("IP Menu"); display.println();
  display.print("AP IP address: "); display.print( WiFi.softAPIP() ); display.println();
}








void checkAllDebugInputs(){
  //https://arduino.stackexchange.com/questions/31256/multiple-client-server-over-wifi


