TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
  //Make Serial Debug command into Function in order for usage with both SerialBT and Serial
  serialDebugCommands(Serial);
#if (FeatureEnable_BT_Serial==true)
  serialDebugCommands(SerialBT);
#endif


  // listen for incoming clients
  if (!SerialWiFiclient.connected()) {
    SerialWiFiclient = SerialWiFiserver.available();
  }
  Serial.print("Client Connected:"); Serial.print(SerialWiFiclient.connected()); Serial.print(" Client available:"); Serial.print(SerialWiFiclient.available()); Serial.println();


  //MAX_SERIAL_WIFI_CLIENTS
  if (SerialWiFiclient) {
    if (SerialWiFiclient.connected()) {
      Serial.println("Connected to Serial client");
      serialDebugCommands(SerialWiFiclient);
    }
    // close the connection:
    //client.stop();
  }
  
  if (WiFi.getMode() != WIFI_MODE_NULL) {
    if (WiFi.getMode() != WIFI_MODE_AP) {
      Serial.print("Local IP address: "); Serial.println(WiFi.localIP());
    };
    if (WiFi.getMode() != WIFI_MODE_STA) {
      Serial.print("SoftAP IP address: "); Serial.println(WiFi.softAPIP());
    };
  }
}



#define MAXDEBUG_TARGETCOMMAND_LENGTH 64
#define MAXDEBUG_COMMANDINPUT_LENGTH 256
#define MAXDEBUG_SUBTARGETCOMMAND_LENGTH 256
#define MAXDEBUG_SUBCOMMANDINPUT_LENGTH 256
class DebugCommands {
  private:
    //buffers
    char targetCommand[ MAXDEBUG_TARGETCOMMAND_LENGTH ];
    char commandInputs[ MAXDEBUG_COMMANDINPUT_LENGTH ];
    char subTargetCommand[ MAXDEBUG_SUBTARGETCOMMAND_LENGTH ];
    char subCommandInputs[ MAXDEBUG_SUBCOMMANDINPUT_LENGTH ];
  public:
    DebugCommands();
    void init();
    //void serialDebugCommands(Stream &serialport);

};
DebugCommands::DebugCommands() {
  //
  init();
}
void DebugCommands::init() {
  //
}
/*
  void DebugCommands::serialDebugCommands(Stream &serialport) {
  //
  }
  //*/


void serialDebugCommands(Stream &serialport)
{
  //https://forum.arduino.cc/t/can-you-pass-a-serial-port-as-a-parameter/658755
  //get serial debug command!
  if (serialport.available() != 0) {
    String debugCommandString = serialport.readString();  //read until timeout
    debugCommandString.trim();// remove any \r \n whitespace at the end of the String
    char debugCommand[ debugCommandString.length() + 1 ]; //maxDebugCommandScan
    debugCommandString.toCharArray(debugCommand, debugCommandString.length() + 1);
    //https://docs.arduino.cc/built-in-examples/communication/ASCIITable

    //Decode serial debug command!
    int debugCommandLength = strlen(debugCommand);
    //init Buffers
    char targetCommand[ MAXDEBUG_TARGETCOMMAND_LENGTH ];
    char commandInputs[ MAXDEBUG_COMMANDINPUT_LENGTH ];
    char subTargetCommand[ MAXDEBUG_SUBTARGETCOMMAND_LENGTH ];
    char subCommandInputs[ MAXDEBUG_SUBCOMMANDINPUT_LENGTH ];
    //
    /*
      char cacheCommand_0[64];
      char cacheCommand_1[64];
      char valueCommandCheckCache_0[64];
      char valueCommandCheckCache_1[64];
      char valueCommandCheckCache_2[64];
      char valueCommandCheckCache_3[64];
      int intDebugValue_0;
      int intDebugValue_1;
      int intDebugValue_2;
      int intDebugValue_3;
      //*/

    printCharArrayValue(serialport, debugCommand, "Debug Command");

    serial_WiFi_DebugCommands(serialport, debugCommand);
    serial_LoRa_DebugCommands(serialport, debugCommand);
    serial_ButtonPISO_DebugCommands(serialport, debugCommand);

    if (commandSelect(debugCommand, "set ")) {
      strcpy(targetCommand, "set ");
      strcpy(commandInputs, &debugCommand[strlen(targetCommand)]);
      printCharArrayValue(serialport, commandInputs, "commandInputs");
      if (commandSelect(commandInputs, "taskbarRotation ")) {
        //command format: set taskbarRotation #
        //command format: set taskbarRotation hidden
        strcpy(subTargetCommand, "taskbarRotation ");
        strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
        printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");
        //https://linuxhint.com/arduino-atoi-function/
        taskbarRotation = atoi(subCommandInputs);//outputs 0 if 0 or is not a valid number
        if (taskbarRotation == 0) {
          if (strcmp(subCommandInputs, "hidden") == 0) {
            taskbarRotation = 0;//taskbar is hidden
          }
        }
        taskbarRotation = taskbarRotation - 1;
        if (taskbarRotation < 0) {
          taskbarRotation = 4;//taskbar is hidden
        }
      }
      if (commandSelect(commandInputs, "chargingFlag ")) {
        //command format: set chargingFlag #
        strcpy(subTargetCommand, "chargingFlag ");
        strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
        printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");
        chargingFlag = atoi(subCommandInputs);
      }
      if (commandSelect(commandInputs, "DebugMenu ")) {
        //command format: set DebugMenu hidden
        //command format: set DebugMenu show
        //command format: set DebugMenu invisible
        //command format: set DebugMenu visible
        strcpy(subTargetCommand, "DebugMenu ");
        strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
        printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");

        if (strcmp(subCommandInputs, "hidden") == 0) {
          showDebugMenu = 0;
        }
        if (strcmp(subCommandInputs, "show") == 0) {
          showDebugMenu = 1;
        }
        if (strcmp(subCommandInputs, "invisible") == 0) {
          showDebugMenu = 0;
        }
        if (strcmp(subCommandInputs, "visible") == 0) {
          showDebugMenu = 1;
        }
        if (showDebugMenu == 0) {
          serialPrintMessageFrom("System_Debug", "hiding debug menu");
        }
        if (showDebugMenu == 1) {
          serialPrintMessageFrom("System_Debug", "showing debug menu");
        }
      }
      if (commandSelect(commandInputs, "MenuID ")) {
        //command format: set MenuID #
        strcpy(subTargetCommand, "MenuID ");
        strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
        printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");
        currentMenuID = atoi(subCommandInputs);
      }

#if (FeatureEnable_IR_RXTX_Control==true)
      //https://github.com/Arduino-IRremote/Arduino-IRremote/blob/master/examples/SendDemo/SendDemo.ino
      if (commandSelect(commandInputs, "IRSender ")) {
        //command format: set IRSender sendValue
        strcpy(subTargetCommand, "IRSender ");
        strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
        printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");

        char *ptr;
        unsigned int sendValue;//0xBD3D00802002

